<script lang="ts">
import Vue from 'vue'
export default Vue.extend({
  layout: 'wiki',
  head: {
    title: 'Игровые клиенты',
  },
})
</script>

<template lang="md">
# Игровые клиенты {.head}

Описание загрузки игрового клиента на лаунчсервер {.lead}

При сборке клиента можно пойти 2-мя путями:

- Сборка вручную
- Использование готовых клиентов с зеркал

Первый вариант для продвинутых пользователей, описан в разделе [Продвинутая загрузка клиентов](/wiki/0.1.0/for-developers/clients).  
Описание второго вы увидите ниже.

В лаунчере имеется 2 набора команд:

- Для скачивания клиентов с пользовательских зеркал: `downloadassets mirror` и `downloadclient mirror`
- Для скачивания клиентов с зеркала Mojang: `downloadassets mojang` и `downloadclient mojang`

Для этого вам нужно выбрать версию и методом последовательного ввода команд, скачать себе нужные файлы.  
Например вы хотите скачать клиент версии 1.12.2 с официального зеркала Mojang.  
Для этого вам нужно загрузить ассеты и клиент с помошью команд:  
`downloadassets mojang 1.12.2 assets1.12.2`, где `assets1.12.2` название папки в которую сохранятся ассеты  
`downloadclient mojang 1.12.2 TestClient`, где `TestClient` название папки в которую сохранится клиент
</template>
